{
    "class": {
        "Basket": 0,
        "BeerBottle": 1,
        "Book": 2,
        "Bottle": 3,
        "Bowl": 4,
        "Calculator": 5,
        "Candle": 6,
        "CellPhone": 7,
        "ComputerMouse": 8,
        "Controller": 9,
        "Cup": 10,
        "Donut": 11,
        "Fork": 12,
        "Hammer": 13,
        "Knife": 14,
        "Marker": 15,
        "MilkCarton": 16,
        "Mug": 17,
        "Pan": 18,
        "Pen": 19,
        "PillBottle": 20,
        "Plate": 21,
        "PowerStrip": 22,
        "Scissors": 23,
        "SoapBottle": 24,
        "SodaCan": 25,
        "Spoon": 26,
        "Stapler": 27,
        "Teapot": 28,
        "VideoGameController": 29,
        "WineBottle": 30,
        "CanOpener": 31,
        "Fruit": 32
    },
    "scene": {
        "dinner": 0
    },
    "size": {
        "L": 0,
        "M": 1,
        "S": 2
    },
    "color": {
        "blue": 0,
        "cyan": 1,
        "green": 2,
        "magenta": 3,
        "red": 4,
        "yellow": 5
    },
    "material": {
        "glass": 0,
        "metal": 1,
        "plastic": 2
    },
    "comparator": {
        "less": 1,
        "greater": 2,
        "equal": 3
    },
    "radius": [
        0,
        0.5,
        3
    ],
    "position_x": [
        -0.1,
        1,
        3
    ],
    "position_y": [
        -0.5,
        0.5,
        3
    ],
    "rotation": [
        -3.15,
        3.15,
        4
    ],
    "height": [
        0,
        0.5,
        10
    ],
    "volumn": [
        0,
        0.015,
        10
    ],
    "uniform_angle": {
        "False": 0,
        "True": 1
    },
    "face_center": {
        "False": 0,
        "True": 1
    },
    "angle_ratio": {
        "0.5": 0,
        "1.0": 1
    },
    "shape": {
        "circle": 0,
        "line": 1,
        "tower": 2,
        "dinner": 3
    },
    "obj_x": [
        -1,
        1,
        200
    ],
    "obj_y": [
        -1,
        1,
        200
    ],
    "obj_z": [
        -1,
        1,
        200
    ],
    "obj_rr": [
        -3.15,
        3.15,
        360
    ],
    "obj_rp": [
        -3.15,
        3.15,
        360
    ],
    "obj_ry": [
        -3.15,
        3.15,
        360
    ],
    "struct_x": [
        -1,
        1,
        200
    ],
    "struct_y": [
        -1,
        1,
        200
    ],
    "struct_z": [
        -1,
        1,
        200
    ],
    "struct_rr": [
        -3.15,
        3.15,
        360
    ],
    "struct_rp": [
        -3.15,
        3.15,
        360
    ],
    "struct_ry": [
        -3.15,
        3.15,
        360
    ]
}